app/views/user/show.html.erb

		<ul class="list-group">
			<% @user.spots.each do |s| %>
---
SELECT "spots".* FROM "spots" WHERE "spots"."user_id" = $1  [["user_id", 1]]