app/controllers/main_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
  	@spots = Spot.all