app/controllers/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
  	@spots = Spot.all

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@spot = Spot.find(params[:id])

INSERT INTO "spots" ("name", "address", "spot_type", "capacity", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	Spot.create(spot_params)