app/controllers/user_controller.rb

  def create
    newUser = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @user = User.find(params[:id])
    @spots = Spot.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "spots".* FROM "spots" WHERE "spots"."user_id" = $1  [["user_id", 1]]